# =============================================================================
# ~/.zsh_plugins.txt — Antidote plugin list
#
# After editing this file, regenerate the static bundle:
#   antidote bundle < ~/.zsh_plugins.txt > ~/.zsh_plugins.zsh
#
# Or let antidote load handle it automatically (slower, checks on each start).
# For fastest startup, use the static bundle approach.
# =============================================================================

# -----------------------------------------------------------------------------
# Completion — extended community completions
# -----------------------------------------------------------------------------
zsh-users/zsh-completions kind:fpath path:src

# -----------------------------------------------------------------------------
# Syntax highlighting — must load before autosuggestions
# -----------------------------------------------------------------------------
zsh-users/zsh-syntax-highlighting

# -----------------------------------------------------------------------------
# Fish-like inline autosuggestions
# -----------------------------------------------------------------------------
zsh-users/zsh-autosuggestions

# -----------------------------------------------------------------------------
# History substring search (↑/↓ to search history by current input)
# -----------------------------------------------------------------------------
zsh-users/zsh-history-substring-search

# -----------------------------------------------------------------------------
# Oh My Zsh plugins — loaded selectively via use-omz
# Add use-omz first so its dependency resolver runs before the plugins below.
# -----------------------------------------------------------------------------
getantidote/use-omz

ohmyzsh/ohmyzsh path:lib/history.zsh
ohmyzsh/ohmyzsh path:lib/clipboard.zsh
ohmyzsh/ohmyzsh path:lib/key-bindings.zsh

ohmyzsh/ohmyzsh path:plugins/colored-man-pages
ohmyzsh/ohmyzsh path:plugins/docker
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/gitignore
ohmyzsh/ohmyzsh path:plugins/history
ohmyzsh/ohmyzsh path:plugins/kubectl
ohmyzsh/ohmyzsh path:plugins/pip
ohmyzsh/ohmyzsh path:plugins/python
ohmyzsh/ohmyzsh path:plugins/vi-mode

# macOS-specific — only loaded on macOS
ohmyzsh/ohmyzsh path:plugins/brew     kind:fpath
ohmyzsh/ohmyzsh path:plugins/macos
ohmyzsh/ohmyzsh path:plugins/iterm2
