# Brewfile — managed by dotfiles
# Install everything: brew bundle
# Update this file from current machine: brew bundle dump --force

# -----------------------------------------------------------------------------
# Shell & terminal
# -----------------------------------------------------------------------------
brew "antidote"         # zsh plugin manager
brew "bash"             # Bash 5.x (macOS ships Bash 3)
brew "starship"         # cross-shell prompt
brew "zoxide"           # smart cd
brew "fzf"              # fuzzy finder
brew "tmux"             # terminal multiplexer

# -----------------------------------------------------------------------------
# Modern CLI replacements
# -----------------------------------------------------------------------------
brew "bat"              # cat with syntax highlighting
brew "eza"              # ls replacement
brew "ripgrep"          # grep replacement
brew "fd"               # find replacement
brew "bottom"           # htop replacement (btm)
brew "htop"
brew "dust"             # du replacement
brew "duf"              # df replacement

# -----------------------------------------------------------------------------
# Version control
# -----------------------------------------------------------------------------
brew "git"
brew "git-delta"        # diff pager
brew "gh"               # GitHub CLI
brew "lazygit"          # terminal git UI

# -----------------------------------------------------------------------------
# Data & text
# -----------------------------------------------------------------------------
brew "jq"               # JSON processor
brew "yq"               # YAML processor
brew "curl"
brew "wget"
brew "tree"

# -----------------------------------------------------------------------------
# Dev utilities
# -----------------------------------------------------------------------------
brew "direnv"           # per-directory env vars
brew "fnm"              # Node version manager
brew "uv"               # Python package/project manager (replaces pip + venv + pyenv)
brew "gnupg"            # GPG
brew "actionlint"       # GitHub Actions linter
brew "neovim"           # terminal editor ($EDITOR)

# -----------------------------------------------------------------------------
# Cloud & infrastructure
# -----------------------------------------------------------------------------
brew "helm"             # Kubernetes package manager

# -----------------------------------------------------------------------------
# AI & ML
# -----------------------------------------------------------------------------
brew "ollama"           # local LLM runner
brew "libomp"           # OpenMP (required for some ML libs)
brew "cmake"

# -----------------------------------------------------------------------------
# Casks — productivity
# -----------------------------------------------------------------------------
cask "raycast"          # Spotlight replacement
cask "obsidian"         # knowledge base
cask "stats"            # menu bar system stats
cask "protonvpn"

# -----------------------------------------------------------------------------
# Casks — terminals & editors
# -----------------------------------------------------------------------------
cask "ghostty"          # GPU-accelerated terminal
cask "cmux"             # workspace terminal (built on Ghostty)
cask "cursor"           # AI-native editor
cask "zed"              # fast Rust-native editor

# -----------------------------------------------------------------------------
# Casks — browsers
# -----------------------------------------------------------------------------
cask "brave-browser"
cask "firefox"
cask "google-chrome"

# -----------------------------------------------------------------------------
# Casks — dev tooling
# -----------------------------------------------------------------------------
cask "orbstack"         # Docker Desktop replacement
cask "tableplus"        # database GUI
cask "karabiner-elements"
cask "keymapp"          # ZSA keyboard configurator
cask "finicky"          # browser router

# -----------------------------------------------------------------------------
# Casks — AI
# -----------------------------------------------------------------------------
cask "claude"           # Claude desktop app
cask "lm-studio"        # local model GUI

# -----------------------------------------------------------------------------
# Casks — general
# -----------------------------------------------------------------------------
cask "spotify"
cask "zoom"

# -----------------------------------------------------------------------------
# Casks — misc
# -----------------------------------------------------------------------------
cask "finetune"
cask "miniforge"        # conda for ML/GPU workloads

# -----------------------------------------------------------------------------
# VS Code / Cursor extensions
# -----------------------------------------------------------------------------
vscode "anthropic.claude-code"
vscode "anysphere.remote-ssh"

# -----------------------------------------------------------------------------
# uv tools
# -----------------------------------------------------------------------------
uv "modal"

# -----------------------------------------------------------------------------
# npm globals
# -----------------------------------------------------------------------------
npm "corepack"
